app/controllers/comments_controller.rb

	def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sampurna Chapagain"], ["body", "Sonam Kapoor is so beautiful indeed !"], ["post_id", 7], ["created_at", "2016-10-05 14:09:45.590133"], ["updated_at", "2016-10-05 14:09:45.590133"]]