app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts"
---
    def index
		@posts = Post.all.order('created_at DESC').paginate(page: params[:page], per_page: 5)

INSERT INTO "posts" ("title", "body", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
      @post = Post.new(post_params)

      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "sonam-kapoor-35a.jpg"], ["image_file_size", 280180], ["image_updated_at", "2016-09-28 19:00:13.593983"], ["updated_at", "2016-09-28 19:00:14.397116"], ["id", 13]]
---
    def update
    	@post = Post.find(params[:id])

    	if @post.update(params[:post].permit(:title, :body, :image))